:PROPERTIES:
:UPDATED:  [2022-08-08 Mon 12:10]
:END:
#+title: gnu guix & rde config
#+property: header-args        :tangle-mode (identity #o444)
#+property: header-args:sh     :tangle-mode (identity #o755)
#+property: header-args:scheme :noweb-ref conf


* test
:PROPERTIES:
:ID:       cdeb56a4-5c09-4531-bba6-0c0c31bbdd55
:CREATED:  [2022-08-01 Mon 12:27]
:UPDATED:  [2022-08-01 Mon 12:27]
:ROAM_EXCLUDE: t
:END:

#+begin_src shell :results drawer
make ixy-home >&/tmp/o

cat /tmp/o
#+end_src

#+RESULTS:
:results:
GUILE_LOAD_PATH=../../../ RDE_TARGET=%-home \
guix home reconfigure ./configs.scm
"pre-%abcdw-features"
"pre-%main-features"
rde/examples/abcdw/configs.scm:1032:1: missing closing parenthesis
make: *** [Makefile:14: %-home-reconfigure] Error 1
:end:

